# DepthDimensionNotExisted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..DepthDimensionNotExisted Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DepthDimensionNotExisted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DepthDimensionNotExisted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DepthDimensionNotExisted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace